Revit 2027 API
IFCTransformSetter.InitializeFromBoundingBox Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform InitializeFromBoundingBox(
	ExporterIFC exporterIFC,
	IList<GeometryObject> geometryList,
	IFCExtrusionCreationData exportBodyParams
)
Public Function InitializeFromBoundingBox (
	exporterIFC As ExporterIFC,
	geometryList As IList(Of GeometryObject),
	exportBodyParams As IFCExtrusionCreationData
) As Transform
public:
Transform^ InitializeFromBoundingBox(
	ExporterIFC^ exporterIFC,
	IList<GeometryObject^>^ geometryList,
	IFCExtrusionCreationData^ exportBodyParams
)
member InitializeFromBoundingBox :
        exporterIFC : ExporterIFC *
        geometryList : IList<GeometryObject> *
        exportBodyParams : IFCExtrusionCreationData -> Transform
Parameters
exporterIFC ExporterIFC
geometryList IList<GeometryObject>
exportBodyParams IFCExtrusionCreationData
Return Value
Transform
See Also
Reference
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace